// # Пошук простих чисел в діапазоні від 1 до 50
// # Пошук простих чисел в діапазоні від 1 до X
// # Пошук простих чисел в діапазоні від X до Y
// # Видалення дублікатів у масиві
// # Зворотний порядок слів у рядку
// # Перевірка наявності дублікатів в масиві
// # Визначення кількості входжень елементів у масив
// # Знаходження найбільшого середнього значення вкладених масивів
// # Визначення суми елементів масиву, що повторюються
// # Обертання матриці на 90 градусів проти годинникової стрілки
// # Гра "Камінь, ножиці, папір"
// # Генерація Паскалівого трикутника
