const os = require('os');
os.networkInterfaces()
// console.log(`Платформа: ${os.platform()}`); // Показує тип операційної системи
// console.log(`Версія ОС: ${os.release()}`); // Виводить версію операційної системи
// console.log(`Архітектура процесора: ${os.arch()}`); // Повідомляє про архітектуру CPU
// console.log(`Інформація про CPU:`, os.cpus()); // Дає деталі процесорів
// console.log(`Загальна пам'ять: ${os.totalmem()} байт`); // Загальний об'єм оперативної пам'яті
// console.log(`Вільна пам'ять: ${os.freemem()} байт`); // Вільний об'єм оперативної пам'яті
// console.log(`Тимчасова директорія: ${os.tmpdir()}`); // Шлях до тимчасової папки
// console.log(`Мережеві інтерфейси:`, os.networkInterfaces()); // Інформація про мережеві інтерфейси
